test_result/fio-3.28-4R5J0001-rr-1G-qd256-num1-4K-3000-WT.txt
fio: Any use of blockalign= turns off randommap
fio-3.28-4R5J0001-randread-1G-256-1-4K: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685643,
  "timestamp_ms" : 1750685643527,
  "time" : "Mon Jun 23 21:34:03 2025",
  "global options" : {
    "ba" : "192K"
  },
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-randread-1G-256-1-4K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-randread-1G-256-1-4K",
        "filename" : "/dev/sda",
        "rw" : "randread",
        "bs" : "4K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "256",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 687855108,
        "bw" : 671733,
        "iops" : 167933.376041,
        "runtime" : 1561,
        "total_ios" : 262144,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2178,
          "max" : 170268,
          "mean" : 4281.705261,
          "stddev" : 4835.047674,
          "N" : 262144
        },
        "clat_ns" : {
          "min" : 1019522,
          "max" : 3266608,
          "mean" : 1518147.821030,
          "stddev" : 162001.836516,
          "N" : 262144,
          "percentile" : {
            "1.000000" : 1187840,
            "5.000000" : 1269760,
            "10.000000" : 1318912,
            "20.000000" : 1384448,
            "30.000000" : 1433600,
            "40.000000" : 1466368,
            "50.000000" : 1515520,
            "60.000000" : 1548288,
            "70.000000" : 1597440,
            "80.000000" : 1646592,
            "90.000000" : 1728512,
            "95.000000" : 1794048,
            "99.000000" : 1925120,
            "99.500000" : 1990656,
            "99.900000" : 2277376,
            "99.950000" : 2539520,
            "99.990000" : 3096576
          },
          "bins" : {
            "1019904" : 1,
            "1044480" : 1,
            "1056768" : 4,
            "1073152" : 5,
            "1089536" : 16,
            "1105920" : 33,
            "1122304" : 81,
            "1138688" : 244,
            "1155072" : 477,
            "1171456" : 932,
            "1187840" : 1160,
            "1204224" : 1732,
            "1220608" : 2162,
            "1236992" : 2622,
            "1253376" : 2714,
            "1269760" : 3197,
            "1286144" : 3764,
            "1302528" : 4425,
            "1318912" : 5182,
            "1335296" : 5852,
            "1351680" : 7098,
            "1368064" : 7941,
            "1384448" : 8398,
            "1400832" : 9239,
            "1417216" : 9778,
            "1433600" : 9789,
            "1449984" : 10061,
            "1466368" : 10443,
            "1482752" : 10902,
            "1499136" : 10882,
            "1515520" : 10985,
            "1531904" : 10725,
            "1548288" : 10445,
            "1564672" : 9746,
            "1581056" : 9514,
            "1597440" : 9016,
            "1613824" : 8364,
            "1630208" : 7679,
            "1646592" : 7106,
            "1662976" : 6377,
            "1679360" : 5850,
            "1695744" : 5199,
            "1712128" : 4664,
            "1728512" : 4350,
            "1744896" : 3444,
            "1761280" : 3053,
            "1777664" : 2838,
            "1794048" : 2394,
            "1810432" : 1780,
            "1826816" : 1594,
            "1843200" : 1388,
            "1859584" : 1303,
            "1875968" : 1055,
            "1892352" : 808,
            "1908736" : 597,
            "1925120" : 465,
            "1941504" : 333,
            "1957888" : 254,
            "1974272" : 226,
            "1990656" : 181,
            "2007040" : 152,
            "2023424" : 157,
            "2039808" : 118,
            "2056192" : 101,
            "2072576" : 73,
            "2088960" : 63,
            "2113536" : 118,
            "2146304" : 72,
            "2179072" : 68,
            "2211840" : 53,
            "2244608" : 33,
            "2277376" : 33,
            "2310144" : 26,
            "2342912" : 18,
            "2375680" : 11,
            "2408448" : 12,
            "2441216" : 18,
            "2473984" : 13,
            "2506752" : 3,
            "2539520" : 15,
            "2572288" : 9,
            "2605056" : 6,
            "2637824" : 1,
            "2670592" : 7,
            "2703360" : 9,
            "2736128" : 8,
            "2768896" : 7,
            "2801664" : 8,
            "2834432" : 2,
            "2899968" : 13,
            "2932736" : 7,
            "2965504" : 2,
            "2998272" : 1,
            "3031040" : 1,
            "3063808" : 5,
            "3096576" : 8,
            "3129344" : 7,
            "3162112" : 7,
            "3194880" : 2,
            "3227648" : 2,
            "3260416" : 7
          }
        },
        "lat_ns" : {
          "min" : 1024702,
          "max" : 3270005,
          "mean" : 1522533.925369,
          "stddev" : 162011.525111,
          "N" : 262144
        },
        "bw_min" : 668856,
        "bw_max" : 676136,
        "bw_agg" : 100.000000,
        "bw_mean" : 672496.000000,
        "bw_dev" : 3640.000000,
        "bw_samples" : 3,
        "iops_min" : 167214,
        "iops_max" : 169034,
        "iops_mean" : 168123.333333,
        "iops_stddev" : 910.000733,
        "iops_samples" : 3
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1560,
      "usr_cpu" : 14.935897,
      "sys_cpu" : 66.346154,
      "ctx" : 12192,
      "majf" : 0,
      "minf" : 264,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.975967
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999618,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 99.516678,
        "4" : 0.483322,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 256,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 231980,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 340056,
      "write_ticks" : 0,
      "in_queue" : 340056,
      "util" : 93.530997
    }
  ]
}

fio-3.28-4R5J0001-randread-1G-256-1-4K: (groupid=0, jobs=1): err= 0: pid=77350: Mon Jun 23 21:34:03 2025
  read: IOPS=168k, BW=656MiB/s (688MB/s)(1024MiB/1561msec)
    slat (usec): min=2, max=170, avg= 4.28, stdev= 4.84
    clat (usec): min=1019, max=3266, avg=1518.15, stdev=162.00
     lat (usec): min=1024, max=3270, avg=1522.53, stdev=162.01
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1270], 10.00th=[ 1319], 20.00th=[ 1385],
     | 30.00th=[ 1434], 40.00th=[ 1467], 50.00th=[ 1516], 60.00th=[ 1549],
     | 70.00th=[ 1598], 80.00th=[ 1647], 90.00th=[ 1729], 95.00th=[ 1795],
     | 99.00th=[ 1926], 99.50th=[ 1991], 99.90th=[ 2278], 99.95th=[ 2540],
     | 99.99th=[ 3097]
   bw (  KiB/s): min=668856, max=676136, per=100.00%, avg=672496.00, stdev=3640.00, samples=3
   iops        : min=167214, max=169034, avg=168123.33, stdev=910.00, samples=3
  lat (msec)   : 2=99.52%, 4=0.48%
  cpu          : usr=14.94%, sys=66.35%, ctx=12192, majf=0, minf=264
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=656MiB/s (688MB/s), 656MiB/s-656MiB/s (688MB/s-688MB/s), io=1024MiB (1074MB), run=1561-1561msec

Disk stats (read/write):
  sda: ios=231980/0, merge=0/0, ticks=340056/0, in_queue=340056, util=93.53%